In [1]:
import pyspark

In [2]:
from pyspark.sql import SparkSession

In [3]:
spark=SparkSession.builder.appName('meow').getOrCreate()

In [4]:
df_pyspark=spark.read.csv('test3.csv',header=True,inferSchema=True)

In [5]:
df_pyspark.show()

+-----+----+----------+------+
|Name | Age|Experience|Salary|
+-----+----+----------+------+
|Aryan|  20|        34| 69000|
|Grace|  19|        29|220000|
|Sneha|  19|        78|170000|
| Rene|  33|        22| 22000|
| John|  20|        11| 18000|
| Isen|  22|        45| 90000|
| Arlo|  19|        12|120000|
|Blyke|  21|        22|200000|
| null|null|      null|230000|
+-----+----+----------+------+

In [7]:
## drop the columns
df_pyspark.drop('Name ').show()

+----+----------+------+
| Age|Experience|Salary|
+----+----------+------+
|  20|        34| 69000|
|  19|        29|220000|
|  19|        78|170000|
|  33|        22| 22000|
|  20|        11| 18000|
|  22|        45| 90000|
|  19|        12|120000|
|  21|        22|200000|
|null|      null|230000|
+----+----------+------+

In [8]:
df_pyspark.show()

+-----+----+----------+------+
|Name | Age|Experience|Salary|
+-----+----+----------+------+
|Aryan|  20|        34| 69000|
|Grace|  19|        29|220000|
|Sneha|  19|        78|170000|
| Rene|  33|        22| 22000|
| John|  20|        11| 18000|
| Isen|  22|        45| 90000|
| Arlo|  19|        12|120000|
|Blyke|  21|        22|200000|
| null|null|      null|230000|
+-----+----+----------+------+

In [9]:
df_pyspark.na.drop().show()## dropped the null ones

+-----+---+----------+------+
|Name |Age|Experience|Salary|
+-----+---+----------+------+
|Aryan| 20|        34| 69000|
|Grace| 19|        29|220000|
|Sneha| 19|        78|170000|
| Rene| 33|        22| 22000|
| John| 20|        11| 18000|
| Isen| 22|        45| 90000|
| Arlo| 19|        12|120000|
|Blyke| 21|        22|200000|
+-----+---+----------+------+

In [10]:
## any == how
df_pyspark.na.drop(how='any').show() ## even if one null is present we drop that row

+-----+---+----------+------+
|Name |Age|Experience|Salary|
+-----+---+----------+------+
|Aryan| 20|        34| 69000|
|Grace| 19|        29|220000|
|Sneha| 19|        78|170000|
| Rene| 33|        22| 22000|
| John| 20|        11| 18000|
| Isen| 22|        45| 90000|
| Arlo| 19|        12|120000|
|Blyke| 21|        22|200000|
+-----+---+----------+------+

In [11]:
## all==how
df_pyspark.na.drop(how='all').show()##drops only if all are null

+-----+----+----------+------+
|Name | Age|Experience|Salary|
+-----+----+----------+------+
|Aryan|  20|        34| 69000|
|Grace|  19|        29|220000|
|Sneha|  19|        78|170000|
| Rene|  33|        22| 22000|
| John|  20|        11| 18000|
| Isen|  22|        45| 90000|
| Arlo|  19|        12|120000|
|Blyke|  21|        22|200000|
| null|null|      null|230000|
+-----+----+----------+------+

In [12]:
## threshold
df_pyspark.na.drop(how='any',thresh=2).show()##atleast 2 null values we need

+-----+---+----------+------+
|Name |Age|Experience|Salary|
+-----+---+----------+------+
|Aryan| 20|        34| 69000|
|Grace| 19|        29|220000|
|Sneha| 19|        78|170000|
| Rene| 33|        22| 22000|
| John| 20|        11| 18000|
| Isen| 22|        45| 90000|
| Arlo| 19|        12|120000|
|Blyke| 21|        22|200000|
+-----+---+----------+------+

In [15]:
## subset
df_pyspark.na.drop(how='any',subset=['Experience']).show()
## see if we have a nan value in the exp column

+-----+---+----------+------+
|Name |Age|Experience|Salary|
+-----+---+----------+------+
|Aryan| 20|        34| 69000|
|Grace| 19|        29|220000|
|Sneha| 19|        78|170000|
| Rene| 33|        22| 22000|
| John| 20|        11| 18000|
| Isen| 22|        45| 90000|
| Arlo| 19|        12|120000|
|Blyke| 21|        22|200000|
+-----+---+----------+------+

In [20]:
##filling the missing  values
df_pyspark.na.fill('NA','Experience').show()#should fill nulls of experience 
#with NA dk why its not happening

+-----+----+----------+------+
|Name | Age|Experience|Salary|
+-----+----+----------+------+
|Aryan|  20|        34| 69000|
|Grace|  19|        29|220000|
|Sneha|  19|        78|170000|
| Rene|  33|        22| 22000|
| John|  20|        11| 18000|
| Isen|  22|        45| 90000|
| Arlo|  19|        12|120000|
|Blyke|  21|        22|200000|
| null|null|      null|230000|
+-----+----+----------+------+

In [21]:
df_pyspark.show()

+-----+----+----------+------+
|Name | Age|Experience|Salary|
+-----+----+----------+------+
|Aryan|  20|        34| 69000|
|Grace|  19|        29|220000|
|Sneha|  19|        78|170000|
| Rene|  33|        22| 22000|
| John|  20|        11| 18000|
| Isen|  22|        45| 90000|
| Arlo|  19|        12|120000|
|Blyke|  21|        22|200000|
| null|null|      null|230000|
+-----+----+----------+------+

In [ ]:
## use imputer functions to replace the nulls with means etc